; domain
(define (domain sim_movement_domain)

    (:requirements :strips :action-costs)

    (:types
        location
        enemy
    )

    (:predicates
        (enemy_loc ?enemy - enemy ?loc - location)
        (con ?from ?to - location)          ; locations are connected
        (wall ?loc1 ?loc2 - location)       ; wall between locations
        (blocked ?loc - location)           ; location is blocked by enviroment or other enemy
        (current_turn ?enemy - enemy)
        (next_turn ?enemy_1 ?enemy_2 - enemy)
        (goal_tile ?loc - location)
        (goal_reached ?enemy - enemy)
    )

    (:functions (total-cost) - number)

    (:action move
        :parameters (?from ?to - location ?enemy ?next_enemy - enemy)
        :precondition (and 
            (or (con ?from ?to) (con ?to ?from)) 
            (enemy_loc ?enemy ?from) 
            (current_turn ?enemy) 
            (not (goal_reached ?enemy))
            (next_turn ?enemy ?next_enemy) 
            (not (blocked ?to)) 
            (not (or (wall ?from ?to) (wall ?to ?from))) 
            )
        :effect (and 
            (enemy_loc ?enemy ?to)
            (not (enemy_loc ?enemy ?from))
            (when (not (goal_tile ?to)) 
                (blocked ?to)
            )
            (when (goal_tile ?to) 
                (goal_reached ?enemy)
            )
            (not (blocked ?from))
            (not (current_turn ?enemy))
            (current_turn ?next_enemy)

            (increase (total-cost) 1)
        )
    )
    (:action skip_goal_reached_enemy
        :parameters (?enemy ?next_enemy - enemy)
        :precondition (and 
            (next_turn ?enemy ?next_enemy) 
            (goal_reached ?enemy)
            (current_turn ?enemy) 
        )
        :effect (and 
            (not (current_turn ?enemy))
            (current_turn ?next_enemy)
        )
    )
)

; problem
(define (problem messure_problem)

    (:domain sim_movement_domain)
    
    (:objects
        a8 b8 c8 d8 e8 f8 g8 h8 
        a7 b7 c7 d7 e7 f7 g7 h7 
        a6 b6 c6 d6 e6 f6 g6 h6 
        a5 b5 c5 d5 e5 f5 g5 h5 
        a4 b4 c4 d4 e4 f4 g4 h4 
        a3 b3 c3 d3 e3 f3 g3 h3 
        a2 b2 c2 d2 e2 f2 g2 h2 
        a1 b1 c1 d1 e1 f1 g1 h1 
         - location
        en1 en2 en3 en4  - enemy
    )
    
    (:init 
        (enemy_loc en1 d2) 
        (enemy_loc en2 e2) 
        (enemy_loc en3 a7) 
        (enemy_loc en4 d5) 
        
        
        (next_turn en1 en2)
        (next_turn en2 en3)
        (next_turn en3 en4)
        (next_turn en4 en1)
        

        (current_turn en1)
        
        ; column connections
        (con a8 a7) (con b8 b7) (con c8 c7) (con d8 d7) (con e8 e7) (con f8 f7) (con g8 g7) (con h8 h7) 
        (con a7 a6) (con b7 b6) (con c7 c6) (con d7 d6) (con e7 e6) (con f7 f6) (con g7 g6) (con h7 h6) 
        (con a6 a5) (con b6 b5) (con c6 c5) (con d6 d5) (con e6 e5) (con f6 f5) (con g6 g5) (con h6 h5) 
        (con a5 a4) (con b5 b4) (con c5 c4) (con d5 d4) (con e5 e4) (con f5 f4) (con g5 g4) (con h5 h4) 
        (con a4 a3) (con b4 b3) (con c4 c3) (con d4 d3) (con e4 e3) (con f4 f3) (con g4 g3) (con h4 h3) 
        (con a3 a2) (con b3 b2) (con c3 c2) (con d3 d2) (con e3 e2) (con f3 f2) (con g3 g2) (con h3 h2) 
        (con a2 a1) (con b2 b1) (con c2 c1) (con d2 d1) (con e2 e1) (con f2 f1) (con g2 g1) (con h2 h1) 
        
        
        
        ; row connections
        (con a8 b8) (con b8 c8) (con c8 d8) (con d8 e8) (con e8 f8) (con f8 g8) (con g8 h8) 
        (con a7 b7) (con b7 c7) (con c7 d7) (con d7 e7) (con e7 f7) (con f7 g7) (con g7 h7) 
        (con a6 b6) (con b6 c6) (con c6 d6) (con d6 e6) (con e6 f6) (con f6 g6) (con g6 h6) 
        (con a5 b5) (con b5 c5) (con c5 d5) (con d5 e5) (con e5 f5) (con f5 g5) (con g5 h5) 
        (con a4 b4) (con b4 c4) (con c4 d4) (con d4 e4) (con e4 f4) (con f4 g4) (con g4 h4) 
        (con a3 b3) (con b3 c3) (con c3 d3) (con d3 e3) (con e3 f3) (con f3 g3) (con g3 h3) 
        (con a2 b2) (con b2 c2) (con c2 d2) (con d2 e2) (con e2 f2) (con f2 g2) (con g2 h2) 
        (con a1 b1) (con b1 c1) (con c1 d1) (con d1 e1) (con e1 f1) (con f1 g1) (con g1 h1) 
        
        
        (blocked d2) (blocked e2) (blocked a7) (blocked d5) 
        
        

        

        (goal_tile g3) 
    )
    
    (:goal
        (and
          (goal_reached en1)
          (goal_reached en2)
          (goal_reached en3)
          (goal_reached en4)
          )
    )

    (:metric minimize (total-cost))
)

; plan
1. (move d2 d3 en1 en2)
   deleted: (enemy_loc en1 d2) (blocked d2) (current_turn en1)
   added: (enemy_loc en1 d3) (blocked d3) (current_turn en2)
   goals met: 0 of 4
2. (move e2 f2 en2 en3)
   deleted: (enemy_loc en2 e2) (blocked e2) (current_turn en2)
   added: (enemy_loc en2 f2) (blocked f2) (current_turn en3)
   goals met: 0 of 4
3. (move a7 a6 en3 en4)
   deleted: (enemy_loc en3 a7) (blocked a7) (current_turn en3)
   added: (enemy_loc en3 a6) (blocked a6) (current_turn en4)
   goals met: 0 of 4
4. (move d5 d4 en4 en1)
   deleted: (enemy_loc en4 d5) (blocked d5) (current_turn en4)
   added: (enemy_loc en4 d4) (blocked d4) (current_turn en1)
   goals met: 0 of 4
5. (move d3 e3 en1 en2)
   deleted: (enemy_loc en1 d3) (blocked d3) (current_turn en1)
   added: (enemy_loc en1 e3) (blocked e3) (current_turn en2)
   goals met: 0 of 4
6. (move f2 g2 en2 en3)
   deleted: (enemy_loc en2 f2) (blocked f2) (current_turn en2)
   added: (enemy_loc en2 g2) (blocked g2) (current_turn en3)
   goals met: 0 of 4
7. (move a6 a5 en3 en4)
   deleted: (enemy_loc en3 a6) (blocked a6) (current_turn en3)
   added: (enemy_loc en3 a5) (blocked a5) (current_turn en4)
   goals met: 0 of 4
8. (move d4 d3 en4 en1)
   deleted: (enemy_loc en4 d4) (blocked d4) (current_turn en4)
   added: (enemy_loc en4 d3) (blocked d3) (current_turn en1)
   goals met: 0 of 4
9. (move e3 f3 en1 en2)
   deleted: (enemy_loc en1 e3) (blocked e3) (current_turn en1)
   added: (enemy_loc en1 f3) (blocked f3) (current_turn en2)
   goals met: 0 of 4
10. (move g2 g3 en2 en3)
   deleted: (enemy_loc en2 g2) (blocked g2) (current_turn en2)
   added: (enemy_loc en2 g3) (goal_reached en2) (current_turn en3)
   goals met: 1 of 4
11. (move a5 a4 en3 en4)
   deleted: (enemy_loc en3 a5) (blocked a5) (current_turn en3)
   added: (enemy_loc en3 a4) (blocked a4) (current_turn en4)
   goals met: 1 of 4
12. (move d3 e3 en4 en1)
   deleted: (enemy_loc en4 d3) (blocked d3) (current_turn en4)
   added: (enemy_loc en4 e3) (blocked e3) (current_turn en1)
   goals met: 1 of 4
13. (move f3 g3 en1 en2)
   deleted: (enemy_loc en1 f3) (blocked f3) (current_turn en1)
   added: (enemy_loc en1 g3) (goal_reached en1) (current_turn en2)
   goals met: 2 of 4
14. (skip_goal_reached_enemy en2 en3)
   deleted: (current_turn en2)
   added: (current_turn en3)
   goals met: 2 of 4
15. (move a4 a3 en3 en4)
   deleted: (enemy_loc en3 a4) (blocked a4) (current_turn en3)
   added: (enemy_loc en3 a3) (blocked a3) (current_turn en4)
   goals met: 2 of 4
16. (move e3 f3 en4 en1)
   deleted: (enemy_loc en4 e3) (blocked e3) (current_turn en4)
   added: (enemy_loc en4 f3) (blocked f3) (current_turn en1)
   goals met: 2 of 4
17. (skip_goal_reached_enemy en1 en2)
   deleted: (current_turn en1)
   added: (current_turn en2)
   goals met: 2 of 4
18. (skip_goal_reached_enemy en2 en3)
   deleted: (current_turn en2)
   added: (current_turn en3)
   goals met: 2 of 4
19. (move a3 b3 en3 en4)
   deleted: (enemy_loc en3 a3) (blocked a3) (current_turn en3)
   added: (enemy_loc en3 b3) (blocked b3) (current_turn en4)
   goals met: 2 of 4
20. (move f3 g3 en4 en1)
   deleted: (enemy_loc en4 f3) (blocked f3) (current_turn en4)
   added: (enemy_loc en4 g3) (goal_reached en4) (current_turn en1)
   goals met: 3 of 4
21. (skip_goal_reached_enemy en1 en2)
   deleted: (current_turn en1)
   added: (current_turn en2)
   goals met: 3 of 4
22. (skip_goal_reached_enemy en2 en3)
   deleted: (current_turn en2)
   added: (current_turn en3)
   goals met: 3 of 4
23. (move b3 c3 en3 en4)
   deleted: (enemy_loc en3 b3) (blocked b3) (current_turn en3)
   added: (enemy_loc en3 c3) (blocked c3) (current_turn en4)
   goals met: 3 of 4
24. (skip_goal_reached_enemy en4 en1)
   deleted: (current_turn en4)
   added: (current_turn en1)
   goals met: 3 of 4
25. (skip_goal_reached_enemy en1 en2)
   deleted: (current_turn en1)
   added: (current_turn en2)
   goals met: 3 of 4
26. (skip_goal_reached_enemy en2 en3)
   deleted: (current_turn en2)
   added: (current_turn en3)
   goals met: 3 of 4
27. (move c3 d3 en3 en4)
   deleted: (enemy_loc en3 c3) (blocked c3) (current_turn en3)
   added: (enemy_loc en3 d3) (blocked d3) (current_turn en4)
   goals met: 3 of 4
28. (skip_goal_reached_enemy en4 en1)
   deleted: (current_turn en4)
   added: (current_turn en1)
   goals met: 3 of 4
29. (skip_goal_reached_enemy en1 en2)
   deleted: (current_turn en1)
   added: (current_turn en2)
   goals met: 3 of 4
30. (skip_goal_reached_enemy en2 en3)
   deleted: (current_turn en2)
   added: (current_turn en3)
   goals met: 3 of 4
31. (move d3 e3 en3 en4)
   deleted: (enemy_loc en3 d3) (blocked d3) (current_turn en3)
   added: (enemy_loc en3 e3) (blocked e3) (current_turn en4)
   goals met: 3 of 4
32. (skip_goal_reached_enemy en4 en1)
   deleted: (current_turn en4)
   added: (current_turn en1)
   goals met: 3 of 4
33. (skip_goal_reached_enemy en1 en2)
   deleted: (current_turn en1)
   added: (current_turn en2)
   goals met: 3 of 4
34. (skip_goal_reached_enemy en2 en3)
   deleted: (current_turn en2)
   added: (current_turn en3)
   goals met: 3 of 4
35. (move e3 f3 en3 en4)
   deleted: (enemy_loc en3 e3) (blocked e3) (current_turn en3)
   added: (enemy_loc en3 f3) (blocked f3) (current_turn en4)
   goals met: 3 of 4
36. (skip_goal_reached_enemy en4 en1)
   deleted: (current_turn en4)
   added: (current_turn en1)
   goals met: 3 of 4
37. (skip_goal_reached_enemy en1 en2)
   deleted: (current_turn en1)
   added: (current_turn en2)
   goals met: 3 of 4
38. (skip_goal_reached_enemy en2 en3)
   deleted: (current_turn en2)
   added: (current_turn en3)
   goals met: 3 of 4
39. (move f3 g3 en3 en4)
   deleted: (enemy_loc en3 f3) (blocked f3) (current_turn en3)
   added: (enemy_loc en3 g3) (goal_reached en3) (current_turn en4)
   goals met: 4 of 4
